fixed template detection to be workflow aware improved debug logs
